benchmarks/results/20260308_235901/05_insights_weekly.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarks/insights_load.js
        output: json (benchmarks/results/20260308_235901/05_insights_weekly.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 1 looping VUs for 1m0s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-03-09T00:03:07+05:30" level=info msg="[setup] Ready — conversationId=11" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1/1 VUs  0m00.5s/1m00.0s

running (0m02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 1/1 VUs  0m01.5s/1m00.0s

running (0m03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 1/1 VUs  0m02.5s/1m00.0s

running (0m04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [   6% ] 1/1 VUs  0m03.5s/1m00.0s

running (0m05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [   8% ] 1/1 VUs  0m04.5s/1m00.0s

running (0m06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [   9% ] 1/1 VUs  0m05.5s/1m00.0s

running (0m07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  11% ] 1/1 VUs  0m06.5s/1m00.0s

running (0m08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  13% ] 1/1 VUs  0m07.5s/1m00.0s

running (0m09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  14% ] 1/1 VUs  0m08.5s/1m00.0s

running (0m10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  16% ] 1/1 VUs  0m09.5s/1m00.0s

running (0m11.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  18% ] 1/1 VUs  0m10.5s/1m00.0s

running (0m12.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [  19% ] 1/1 VUs  0m11.5s/1m00.0s

running (0m13.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  21% ] 1/1 VUs  0m12.5s/1m00.0s

running (0m14.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  23% ] 1/1 VUs  0m13.5s/1m00.0s

running (0m15.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  24% ] 1/1 VUs  0m14.5s/1m00.0s

running (0m16.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  26% ] 1/1 VUs  0m15.5s/1m00.0s

running (0m17.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  28% ] 1/1 VUs  0m16.5s/1m00.0s

running (0m18.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  29% ] 1/1 VUs  0m17.5s/1m00.0s

running (0m19.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
default   [  31% ] 1/1 VUs  0m18.5s/1m00.0s

running (0m20.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
default   [  33% ] 1/1 VUs  0m19.5s/1m00.0s

running (0m21.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
default   [  34% ] 1/1 VUs  0m20.5s/1m00.0s

running (0m22.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
default   [  36% ] 1/1 VUs  0m21.5s/1m00.0s

running (0m23.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  38% ] 1/1 VUs  0m22.5s/1m00.0s

running (0m24.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
default   [  39% ] 1/1 VUs  0m23.5s/1m00.0s

running (0m25.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
default   [  41% ] 1/1 VUs  0m24.5s/1m00.0s

running (0m26.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
default   [  43% ] 1/1 VUs  0m25.5s/1m00.0s

running (0m27.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
default   [  44% ] 1/1 VUs  0m26.5s/1m00.0s

running (0m28.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
default   [  46% ] 1/1 VUs  0m27.5s/1m00.0s

running (0m29.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
default   [  48% ] 1/1 VUs  0m28.5s/1m00.0s

running (0m30.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
default   [  49% ] 1/1 VUs  0m29.5s/1m00.0s

running (0m31.0s), 1/1 VUs, 30 complete and 0 interrupted iterations
default   [  51% ] 1/1 VUs  0m30.5s/1m00.0s

running (0m32.0s), 1/1 VUs, 31 complete and 0 interrupted iterations
default   [  53% ] 1/1 VUs  0m31.5s/1m00.0s

running (0m33.0s), 1/1 VUs, 32 complete and 0 interrupted iterations
default   [  54% ] 1/1 VUs  0m32.5s/1m00.0s

running (0m34.0s), 1/1 VUs, 33 complete and 0 interrupted iterations
default   [  56% ] 1/1 VUs  0m33.5s/1m00.0s

running (0m35.0s), 1/1 VUs, 34 complete and 0 interrupted iterations
default   [  58% ] 1/1 VUs  0m34.5s/1m00.0s

running (0m36.0s), 1/1 VUs, 35 complete and 0 interrupted iterations
default   [  59% ] 1/1 VUs  0m35.5s/1m00.0s

running (0m37.0s), 1/1 VUs, 36 complete and 0 interrupted iterations
default   [  61% ] 1/1 VUs  0m36.5s/1m00.0s

running (0m38.0s), 1/1 VUs, 37 complete and 0 interrupted iterations
default   [  63% ] 1/1 VUs  0m37.5s/1m00.0s

running (0m39.0s), 1/1 VUs, 38 complete and 0 interrupted iterations
default   [  64% ] 1/1 VUs  0m38.5s/1m00.0s

running (0m40.0s), 1/1 VUs, 39 complete and 0 interrupted iterations
default   [  66% ] 1/1 VUs  0m39.5s/1m00.0s

running (0m41.0s), 1/1 VUs, 40 complete and 0 interrupted iterations
default   [  68% ] 1/1 VUs  0m40.5s/1m00.0s

running (0m42.0s), 1/1 VUs, 41 complete and 0 interrupted iterations
default   [  69% ] 1/1 VUs  0m41.5s/1m00.0s

running (0m43.0s), 1/1 VUs, 42 complete and 0 interrupted iterations
default   [  71% ] 1/1 VUs  0m42.5s/1m00.0s

running (0m44.0s), 1/1 VUs, 43 complete and 0 interrupted iterations
default   [  73% ] 1/1 VUs  0m43.5s/1m00.0s

running (0m45.0s), 1/1 VUs, 44 complete and 0 interrupted iterations
default   [  74% ] 1/1 VUs  0m44.5s/1m00.0s

running (0m46.0s), 1/1 VUs, 45 complete and 0 interrupted iterations
default   [  76% ] 1/1 VUs  0m45.5s/1m00.0s

running (0m47.0s), 1/1 VUs, 46 complete and 0 interrupted iterations
default   [  78% ] 1/1 VUs  0m46.5s/1m00.0s

running (0m48.0s), 1/1 VUs, 47 complete and 0 interrupted iterations
default   [  79% ] 1/1 VUs  0m47.5s/1m00.0s

running (0m49.0s), 1/1 VUs, 48 complete and 0 interrupted iterations
default   [  81% ] 1/1 VUs  0m48.5s/1m00.0s

running (0m50.0s), 1/1 VUs, 49 complete and 0 interrupted iterations
default   [  83% ] 1/1 VUs  0m49.5s/1m00.0s

running (0m51.0s), 1/1 VUs, 50 complete and 0 interrupted iterations
default   [  84% ] 1/1 VUs  0m50.5s/1m00.0s

running (0m52.0s), 1/1 VUs, 51 complete and 0 interrupted iterations
default   [  86% ] 1/1 VUs  0m51.5s/1m00.0s

running (0m53.0s), 1/1 VUs, 52 complete and 0 interrupted iterations
default   [  88% ] 1/1 VUs  0m52.5s/1m00.0s

running (0m54.0s), 1/1 VUs, 53 complete and 0 interrupted iterations
default   [  89% ] 1/1 VUs  0m53.5s/1m00.0s

running (0m55.0s), 1/1 VUs, 54 complete and 0 interrupted iterations
default   [  91% ] 1/1 VUs  0m54.5s/1m00.0s

running (0m56.0s), 1/1 VUs, 55 complete and 0 interrupted iterations
default   [  93% ] 1/1 VUs  0m55.5s/1m00.0s

running (0m57.0s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  94% ] 1/1 VUs  0m56.5s/1m00.0s

running (0m58.0s), 1/1 VUs, 57 complete and 0 interrupted iterations
default   [  96% ] 1/1 VUs  0m57.5s/1m00.0s

running (0m59.0s), 1/1 VUs, 58 complete and 0 interrupted iterations
default   [  98% ] 1/1 VUs  0m58.5s/1m00.0s

running (1m00.0s), 1/1 VUs, 59 complete and 0 interrupted iterations
default   [  99% ] 1/1 VUs  0m59.5s/1m00.0s

     ✓ GET /api/insights/weekly → 200
     ✓ GET /api/insights/weekly → has data
     ✓ GET /api/insights/weekly → p95 <2000ms

     █ setup

       ✓ setup: login 200
       ✓ setup: token present
       ✓ setup: conversation 201
       ✓ setup: conversation id present

     checks.........................: 100.00% 184 out of 184
     data_received..................: 43 kB   702 B/s
     data_sent......................: 17 kB   277 B/s
     http_req_blocked...............: avg=17.36µs min=5.54µs  med=7.37µs  max=361.32µs p(50)=7.37µs  p(95)=19.63µs  p(99)=273.1µs 
     http_req_connecting............: avg=5.77µs  min=0s      med=0s      max=204.72µs p(50)=0s      p(95)=0s       p(99)=176.49µs
     http_req_duration..............: avg=13.84ms min=2.96ms  med=7.41ms  max=431.29ms p(50)=7.41ms  p(95)=9.43ms   p(99)=173.35ms
       { expected_response:true }...: avg=14.01ms min=4.81ms  med=7.44ms  max=431.29ms p(50)=7.44ms  p(95)=9.43ms   p(99)=177.51ms
     ✓ { name:insights_weekly }.....: avg=7.04ms  min=4.81ms  med=7.4ms   max=10.45ms  p(50)=7.4ms   p(95)=9.13ms   p(99)=9.85ms  
     http_req_failed................: 1.58%   1 out of 63
     ✓ { name:insights_weekly }.....: 0.00%   0 out of 60
     http_req_receiving.............: avg=97.86µs min=59.67µs med=92.4µs  max=196.44µs p(50)=92.4µs  p(95)=151.92µs p(99)=178.18µs
     http_req_sending...............: avg=32.36µs min=19.34µs med=27.21µs max=161.92µs p(50)=27.21µs p(95)=52.57µs  p(99)=108.32µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(50)=0s      p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=13.71ms min=2.71ms  med=7.29ms  max=431.14ms p(50)=7.29ms  p(95)=9.28ms   p(99)=173.2ms 
     http_reqs......................: 63      1.033899/s
     iteration_duration.............: avg=1s      min=1s      med=1s      max=1.01s    p(50)=1s      p(95)=1.01s    p(99)=1.01s   
     iterations.....................: 60      0.984666/s
     vus............................: 1       min=1          max=1
     vus_max........................: 1       min=1          max=1


running (1m00.9s), 0/1 VUs, 60 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/1 VUs  1m0s